package org.example.lesson03

class homework {
    val name: String = "Cyber flower"//    Название мероприятия
    var date: String = "5 июня 2027"//    Дата проведения
    var location: String = "парк Покровское-Стрешнево"//    Место проведения
    private val budget: String = "подробная информация с перечислением поставщиков и сумм для внутреннего пользования"//    Подробный бюджет мероприятия, включая расходы на оборудование, кейтеринг и другие операционные расходы.
    var participantCount: Int = 0//    Количество участников
        private set
    var durationHackathon: String = "парк Покровское-Стрешнево"//    Длительность хакатона
    private val supplierAgreements: String = "инфа для организаторов о поставщиках и соглашениях"//    Контактная информация и условия соглашений с поставщиками пищи, оборудования и других услуг.
    var hackathonStatus: String = "Идет набор участников"//    Текущее состояние хакатона (статус)
        private set
    val listOfSponsors: String = "Газпром, Нью стар кемп"//    Список спонсоров
    private val totalBudget: Int = 1000//    Бюджет мероприятия
    var internetAccess: String = "белиссимо"//    Текущий уровень доступа к интернету
    var coordinationList: String = "Идет набор участников"//    Информация о транспортировке оборудования, распределении ресурсов и координации между различными командами поддержки.
        private set
    private val teamCount: Int = 5//    Количество команд
    var listOfTask: String = "подготовить компутеры и фломастеры"//    Перечень задач
        private set
    val evacuationPlan: String = "где горит - бежать не надо, бегите туда где не горит"//    План эвакуации
    var availableEquipment: String = "есть стол, есть стул, колонка алисы, а чего еще вам надо на мероприятии за 1 тыщу?"//    Список доступного оборудования (всё, что выделено для использования на мероприятии)
        private set
    var freeEquipment: String = "фломатеры пока никто не взял"//    Список свободного оборудования (всё, что можно взять прямо сейчас и что не занято другими участниками)
    lateinit var mealSchedule: String   //    График питания участников (зависит от поставщика питания, определяемого за неделю до начала)
    private val contingencyPlan: String = "при сбоях раздаем молочные коктейли!"//    План мероприятий на случай сбоев
    val listOfExperts: String = "тут пишем имена важный курица"//    Список экспертов и жюри
    val privacyPolicy: String = "чтоб все держали в секретике"//    Политика конфиденциальности
    private var privateFeedback: String = "поливают розами твое мероприятие"//    Приватные отзывы (фидбэк) участников и зрителей для анализа проблем.
    var temperature: Double = 10.4//    Текущая температура в помещении
    var monitoring: String = "атлична! графана показывает что скорость наивысочайшая! целых 6 Мбит/с"//    Данные мониторинга и анализ производительности сетевого оборудования и интернет-соединения для целей отладки своих приложений командами
        private set
    private var speedInternetRegulator: Double = 5.0
        set(value) {
            if (value > 6.0) {
                field = value-0.5
            }
        } //    Регулятор скорости интернета (понижающий коэффициент, например 0.5)
    var lightingLevel: Int = 1000//    Уровень освещения
        private set
    private var eventLog: String = "Коля украл ноутбук с мероприятия, фломастеров не хватило, говорят свет очень яркий"//    Лог событий мероприятия
    val medicalHelp: Boolean = true//    Возможность получения медицинской помощи прямо на мероприятии (да/нет)
    private var secutityPlan: String = "план такой - бегите голубцы"//    Планы и процедуры для обеспечения безопасности мероприятия, включая планы эвакуации и протоколы чрезвычайных ситуаций.
    val eventRegestrationNumber: Int = 45686599//    Регистрационный номер мероприятия
    val noiseLevel: Int = 20//    Максимально допустимый уровень шума в помещении хакатона.
    var noiseLimit: Boolean = true//    Индикатор превышения уровня шума в помещениях (превышен или не превышен в данный момент)
        private set
    private var pressPlan: String = "Улыбаемся как Майкл Скотт и ничего не говорим"//    План взаимодействия с прессой
    val publicDetailsOfProject: String by lazy {
        "статусы вопщемта"
    }//    Детальная публичная информация о проектах каждой команды, сбор данных включает в себя компиляцию кода и сбор статистики прогона автоматизированных проверок.
    var permissionsStatus: String = "кормят завтраками, вкусно конечно"//    Статус получения всех необходимых разрешений для проведения мероприятия
        private set
    var equipmentAvailable: Boolean = false//    Индикатор доступности специализированного оборудования в данный момент (например, специальному оборудованию)
        private set
    private var partnersList: String = "Пятерочка"//    Список партнеров мероприятия
    lateinit var finalReport: String//    Отчет, включающий фотографии, видео и отзывы, генерируется и становится доступен после завершения мероприятия.
    private val giftPravila: String = "хакатон выиграет тот, кто сделает тетрис на ассемблере"//    Внутренние правила распределения призов
    val giftList: String = "естественно кабачок! и кабачок поменьше"//    Список разыгрываемых призов
    private val emergencyContacts: String = "звоните 911! или 112"//    Контактная информация экстренных служб, медицинского персонала и других важных служб, для внутреннего пользования.
    val accessibilityConditions: String = "выдаем очки, но у нас только на -8"//    Особые условия для участников с ограниченными возможностями
    lateinit var mooood: String//    Общее настроение участников (определяется опросами)
    private lateinit var detailedHackathonPlan: String//    Подробный план хакатона, включающий время и содержание каждого сегмента, инициализируется непосредственно перед началом мероприятия, так как зависит от фактического состава команд и взятых в работу задач.
    lateinit var specialGuest: String//    Имя знаменитого специального гостя, которое будет объявлено за день до мероприятия, но в момент инициализации неизвестно.
    val venueCapacity: Int = 27//    Максимальное количество людей, которое может вместить место проведения.
    val hoursPerTeam: Int = 2//    Количество часов, отведенное каждой команде для работы над проектом.
}